yosys read_verilog -noopt -nolatches -I /workspaces/avr_modification/tests/crafted/sw_ball2004_2 -sv /workspaces/avr_modification/experiment/avr_output/work_sw_ball2004_2_sw_ball2004_2/sw_ball2004_2.v;
yosys hierarchy -auto-top;
yosys hierarchy -libdir /workspaces/avr_modification/experiment/avr_output/work_sw_ball2004_2_sw_ball2004_2;
yosys hierarchy -check;
yosys rename -top main;
yosys delete -output main;
yosys expose main/prop_neg;
yosys proc;
yosys clean;
yosys splitnets -driver;
yosys clean;
yosys pmuxtree;
yosys clean;
yosys memory;
yosys clean;
yosys flatten;
yosys clean -purge;
yosys setundef -undriven -expose -undef;
yosys clean;
yosys check;
yosys write_ilang /workspaces/avr_modification/experiment/avr_output/work_sw_ball2004_2_sw_ball2004_2/sw_ball2004_2_sw_ball2004_2.ilang;
yosys write_verilog -attr2comment /workspaces/avr_modification/experiment/avr_output/work_sw_ball2004_2_sw_ball2004_2/sw_ball2004_2_sw_ball2004_2_y.v;
yosys write_btor /workspaces/avr_modification/experiment/avr_output/work_sw_ball2004_2_sw_ball2004_2/sw_ball2004_2_sw_ball2004_2.btor2;
